print("########################查询操作###############################")
str1="hello,hello"
print(str1.index("lo")) #3
print(str1.find("lo")) #3
print(str1.rindex("lo")) #9
print(str1.rfind("lo")) #9

# print(str1.index("lara")) #找不到报错 valueError
print(str1.find("lara")) #找不到返回-1

print("########################大小写操作###############################")
print(str1.upper()) #转换以后，会变成一个新的字符串，所以是一个新的内存地址
print(str1.lower())  #转换以后，会变成一个新的字符串，所以是一个新的内存地址
print(str1.swapcase())  #大写变小写， 小写变大写
print(str1.capitalize())
print(str1.title()) #每一个单词的i一个字符变成大写，剩下的变成小写
print("########################内容对齐操作###############################")
s='hello,Python'
print(s.center(20,"@")) #按照宽度20居中输出 “@@@@hello,Python@@@@”，二边用@填充
print(s.ljust(20,"@")) #按照宽度20靠左输出“hello,Python@@@@@@@@”，二边用@填充
print(s.ljust(10,)) #按照宽度10的宽度输出，但是本身s就已超出宽度10，这个时候就是原样输出。而不会裁剪
print(s.rjust(20,"@")) #按照宽度20靠右边输出“@@@@@@@@hello,Python”，二边用@填充
print(s.zfill(20)) #按照宽度20靠右边对其输出“00000000hello,Python”，左边用0填充

print("########################劈分操作###############################")
S="HELLO WORLD"
print(S.split()) #默认是空格来作为分割符号

s2="a!b!c!" #['HELLO', 'WORLD']
print(s2.split("!")) #['a', 'b', 'c', '']
print(s2.split("!",maxsplit=1))  #按照！来切分，但是只切分1次. ['a', 'b!c!']

print(s2.rsplit("!")) #['a', 'b', 'c', '']
print(s2.rsplit("!",maxsplit=1))  #按照！来切分，但是只切分1次. ['a!b!c', '']

print("########################判断操作###############################")
s1=""
print(s.isidentifier()) #判断字符串是否是合法的标识符  合法标识符 是字母数字下划线
print(s.isspace()) #是否是有空白字符串组成（回车，换行，水平制表符）
print(s.isalpha()) #是否全部由字母组成
print(s.isdecimal()) #判断是否全部是十进制的数字组成
print(s.isnumeric()) #是否是全部由数字组成
print(s.isalnum()) #全部由数字和字母组成

print("########################替换与合并操作###############################")
print("########################比较操作###############################")
print("########################切片操作###############################")
print("########################格式化操作###############################")
print("########################编码和解码###############################")